redis_test_for_auto_numa_problem/redis_test_result_L_OFF_120G_2nd/memtier_benchmark_L_OFF_120G_2nd_Sequential110_P9_20230625041519.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       146245.21          ---          ---        19.89985        19.83900        26.11100        29.31100    311770.80 
Gets        14624.46     14624.46         0.00        19.71994        19.71100        23.93500        25.34300     31105.54 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     160869.67     14624.46         0.00        19.88349        19.83900        25.98300        29.18300    342876.34 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.823        0.000
SET      16.767        5.000
SET      17.919       10.000
SET      18.303       15.000
SET      18.559       20.000
SET      18.687       25.000
SET      18.943       30.000
SET      19.199       35.000
SET      19.455       40.000
SET      19.583       45.000
SET      19.839       50.000
SET      19.967       52.500
SET      20.095       55.000
SET      20.095       57.500
SET      20.223       60.000
SET      20.351       62.500
SET      20.479       65.000
SET      20.607       67.500
SET      20.735       70.000
SET      20.863       72.500
SET      20.991       75.000
SET      20.991       76.250
SET      21.119       77.500
SET      21.247       78.750
SET      21.247       80.000
SET      21.375       81.250
SET      21.503       82.500
SET      21.503       83.750
SET      21.631       85.000
SET      21.759       86.250
SET      21.887       87.500
SET      22.015       88.125
SET      22.143       88.750
SET      22.143       89.375
SET      22.271       90.000
SET      22.399       90.625
SET      22.527       91.250
SET      22.655       91.875
SET      22.783       92.500
SET      22.911       93.125
SET      23.039       93.750
SET      23.039       94.062
SET      23.167       94.375
SET      23.295       94.688
SET      23.295       95.000
SET      23.423       95.312
SET      23.551       95.625
SET      23.679       95.938
SET      23.807       96.250
SET      23.935       96.562
SET      24.063       96.875
SET      24.191       97.031
SET      24.319       97.188
SET      24.319       97.344
SET      24.447       97.500
SET      24.575       97.656
SET      24.703       97.812
SET      24.959       97.969
SET      25.087       98.125
SET      25.215       98.281
SET      25.343       98.438
SET      25.471       98.516
SET      25.599       98.594
SET      25.727       98.672
SET      25.727       98.750
SET      25.855       98.828
SET      25.983       98.906
SET      26.111       98.984
SET      26.239       99.062
SET      26.367       99.141
SET      26.495       99.219
SET      26.495       99.258
SET      26.623       99.297
SET      26.751       99.336
SET      26.751       99.375
SET      26.879       99.414
SET      27.007       99.453
SET      27.135       99.492
SET      27.135       99.531
SET      27.263       99.570
SET      27.391       99.609
SET      27.519       99.629
SET      27.519       99.648
SET      27.647       99.668
SET      27.775       99.688
SET      27.775       99.707
SET      27.903       99.727
SET      28.031       99.746
SET      28.159       99.766
SET      28.287       99.785
SET      28.415       99.805
SET      28.543       99.814
SET      28.543       99.824
SET      28.671       99.834
SET      28.671       99.844
SET      28.799       99.854
SET      28.927       99.863
SET      29.055       99.873
SET      29.055       99.883
SET      29.183       99.893
SET      29.311       99.902
SET      29.439       99.907
SET      29.439       99.912
SET      29.567       99.917
SET      29.567       99.922
SET      29.695       99.927
SET      29.823       99.932
SET      29.951       99.937
SET      29.951       99.941
SET      30.079       99.946
SET      30.207       99.951
SET      30.335       99.954
SET      30.463       99.956
SET      30.463       99.958
SET      30.591       99.961
SET      30.719       99.963
SET      30.975       99.966
SET      31.103       99.968
SET      31.487       99.971
SET      31.743       99.973
SET      33.023       99.976
SET     183.295       99.977
SET     186.367       99.978
SET     188.415       99.979
SET     189.439       99.980
SET     190.463       99.982
SET     195.583       99.983
SET     197.631       99.984
SET     245.759       99.985
SET     245.759       99.987
SET     259.071       99.988
SET     259.071       99.988
SET     266.239       99.989
SET     272.383       99.990
SET     272.383       99.990
SET     272.383       99.991
SET     284.671       99.991
SET     290.815       99.992
SET     292.863       99.993
SET     294.911       99.993
SET     325.631       99.994
SET     331.775       99.994
SET     331.775       99.995
SET     331.775       99.995
SET     331.775       99.995
[...]
SET     331.775       99.996
SET     331.775       99.996
SET     335.871       99.996
SET     335.871       99.997
SET     335.871       99.997
SET     335.871       99.997
SET     337.919       99.997
SET     337.919       99.997
SET     337.919       99.998
SET     337.919       99.998
SET     337.919       99.998
[...]
SET     339.967       99.998
SET     342.015       99.998
SET     344.063       99.998
SET     344.063       99.999
SET     344.063       99.999
SET     344.063       99.999
[...]
SET     346.111       99.999
SET     346.111       99.999
SET     346.111      100.000
SET     346.111      100.000
SET     346.111      100.000
[...]
SET     350.207      100.000
SET     350.207      100.000
SET     350.207      100.000
[...]
SET     352.255      100.000
SET     352.255      100.000
---
GET       1.703        0.000
GET      16.767        5.000
GET      17.919       10.000
GET      18.303       15.000
GET      18.431       20.000
GET      18.687       25.000
GET      18.943       30.000
GET      19.071       35.000
GET      19.327       40.000
GET      19.583       45.000
GET      19.711       50.000
GET      19.839       52.500
GET      19.967       55.000
GET      20.095       57.500
GET      20.223       60.000
GET      20.223       62.500
GET      20.351       65.000
GET      20.479       67.500
GET      20.607       70.000
GET      20.735       72.500
GET      20.863       75.000
GET      20.863       76.250
GET      20.991       77.500
GET      20.991       78.750
GET      21.119       80.000
GET      21.119       81.250
GET      21.247       82.500
GET      21.375       83.750
GET      21.375       85.000
GET      21.503       86.250
GET      21.631       87.500
GET      21.631       88.125
GET      21.759       88.750
GET      21.759       89.375
GET      21.887       90.000
GET      21.887       90.625
GET      22.015       91.250
GET      22.143       91.875
GET      22.143       92.500
GET      22.271       93.125
GET      22.399       93.750
GET      22.399       94.062
GET      22.527       94.375
GET      22.527       94.688
GET      22.655       95.000
GET      22.655       95.312
GET      22.783       95.625
GET      22.783       95.938
GET      22.911       96.250
GET      22.911       96.562
GET      23.039       96.875
GET      23.039       97.031
GET      23.167       97.188
GET      23.167       97.344
GET      23.167       97.500
GET      23.295       97.656
GET      23.295       97.812
GET      23.423       97.969
GET      23.423       98.125
GET      23.551       98.281
GET      23.551       98.438
GET      23.679       98.516
GET      23.679       98.594
GET      23.679       98.672
GET      23.807       98.750
GET      23.807       98.828
GET      23.807       98.906
GET      23.935       98.984
GET      23.935       99.062
GET      24.063       99.141
GET      24.063       99.219
GET      24.063       99.258
GET      24.191       99.297
GET      24.191       99.336
GET      24.191       99.375
GET      24.319       99.414
GET      24.319       99.453
GET      24.319       99.492
GET      24.447       99.531
GET      24.447       99.570
GET      24.447       99.609
GET      24.575       99.629
GET      24.575       99.648
GET      24.575       99.668
GET      24.703       99.688
GET      24.703       99.707
GET      24.703       99.727
GET      24.831       99.746
GET      24.831       99.766
GET      24.831       99.785
GET      24.959       99.805
GET      24.959       99.814
GET      24.959       99.824
GET      25.087       99.834
GET      25.087       99.844
GET      25.087       99.854
GET      25.215       99.863
GET      25.215       99.873
GET      25.343       99.883
GET      25.343       99.893
GET      25.343       99.902
GET      25.471       99.907
GET      25.471       99.912
GET      25.471       99.917
GET      25.471       99.922
GET      25.599       99.927
GET      25.599       99.932
GET      25.727       99.937
GET      25.727       99.941
GET      25.855       99.946
GET      25.855       99.951
GET      25.983       99.954
GET      25.983       99.956
GET      26.111       99.958
GET      26.111       99.961
GET      26.239       99.963
GET      26.367       99.966
GET      26.495       99.968
GET      26.879       99.971
GET      27.135       99.973
GET      28.159       99.976
GET     182.271       99.977
GET     186.367       99.978
GET     187.391       99.979
GET     189.439       99.980
GET     190.463       99.982
GET     191.487       99.983
GET     197.631       99.984
GET     244.735       99.985
GET     245.759       99.987
GET     259.071       99.988
GET     259.071       99.988
GET     259.071       99.989
GET     266.239       99.990
GET     272.383       99.990
GET     272.383       99.991
GET     284.671       99.991
GET     290.815       99.992
GET     292.863       99.993
GET     292.863       99.993
GET     325.631       99.994
GET     331.775       99.994
GET     331.775       99.995
GET     331.775       99.995
GET     331.775       99.995
[...]
GET     331.775       99.996
GET     331.775       99.996
GET     335.871       99.996
GET     335.871       99.997
GET     335.871       99.997
GET     335.871       99.997
[...]
GET     337.919       99.997
GET     337.919       99.998
GET     337.919       99.998
GET     337.919       99.998
[...]
GET     339.967       99.998
GET     344.063       99.998
GET     344.063       99.999
GET     344.063       99.999
GET     344.063       99.999
[...]
GET     344.063      100.000
GET     344.063      100.000
GET     346.111      100.000
GET     346.111      100.000
---
WAIT      0.000      100.000